Tekla Open API Reference for Tekla Structures 2025
IGeometryNodeVisitor.Visit Method (SpiralNode)
 Visits a node that is an instance of HelixNode
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
void Visit(
	SpiralNode node
)
Sub Visit (
	node As SpiralNode
)
Parameters
node
Type: SpiralNode
[Missing <param name="node"/> documentation for "M:Tekla.Structures.Model.IGeometryNodeVisitor.Visit(Tekla.Structures.ModelInternal.SpiralNode)"]
See Also
Reference
IGeometryNodeVisitor Interface
Visit Overload
Tekla.Structures.Model Namespace